export default {
  logmsg: '正在登入中,请稍后..',
  scmsg: '请先开启 Scatter',
  winmsg: '恭喜你!赢了',
  nav: {
    lang: ["英文","简体中文"],
    wfjs: '玩法介绍',
    db: '电报',
    login: '登陆',
    logout: '退出'
  },
  zhu: {
    tzje: '投注金额',
    yqjl: '赢取奖励',
    xygs: '小于该数获胜',
    pl: '赔率',
    zjgl: '中奖概率',
    kstz: '开始投注',
    wdje: '我的金额',
    kszdtz: '开启自动投注',
    xzkh: '下注可获得',
    sctz: '首次投注奖励'
  },
  pai: {
    ttitle: '今日排行榜',
    ytitle: '排行榜',
    pm: '排名',
    tzz: '投注者',
    ztze: '总投注额',
    jl: '奖励',
    tip: '* 数据最多延迟三分钟并于每天UTC 00:00 重置'
  },
  tabs: {
    head: ["所有投注","我的投注","投注额排行","奖金排行","净利润金排行","总投注额排行","总奖金排行","总投注次数排行"],
    tb1: ["时间","投注者","小于该号码获胜","投注","开奖号码","奖金","验证","查看"],
    tb2: ["时间","投注者","小于该号码获胜","投注","开奖号码","奖金","验证","查看"],
    tb3: ["时间","投注者","最高投注额"],
    tb4: ["时间","投注者","最高奖金"],
    tb5: ["时间","投注者","淨利润"],
    tb6: ["时间","投注者","总投注额"],
    tb7: ["时间","投注者","总奖金"],
    tb8: ["时间","投注者","总投注次数"],
  },
  wfpanel: {
    hp: '玩法介绍',
    "1": {
      txt: '准备好你的EOS 帐号，如果还未有EOS帐号，可根据',
      a: '教程',
      b: '创建'
    },
    "2": {
      txt: '您需要透过Scatter 在网页上操作帐号，如果还未有安装Scatter，请',
      a: '安装Scatter',
    },
    "3": {
      txt: '按下登入按钮，透过Scatter 进行登入'
    },
    "4": {
      txt: '设置需要投注量',
    },
    "5": {
      txt: '调整滑条投注骰子号码上限，改变胜出机率',
    },
    "6": {
      txt: '按下"掷骰子"按钮进行投注，如果 摇到骰子号码小于投注骰子号码上限，立即中奖',
    },
    "7": {
      txt: '** 由于游戏都在EOS 的智能合约上执，因此游戏保证公平，并不能作弊。我们透过独有的加密技术，保证赛果不会被更改，请您放心下注。'
    },
  },
  dlpanel: {
    hp: '开启Scatter',
    content: '如未安装Scatter请先下载',
    btn: '下载'
  },
  alertSuc: {
    p1: '恭喜你，你押注',
    p2: '掷出',
    p3: '赢得'
  },
  alertFai: {
    p1: '很抱歉，你押注',
    p2: '掷出'
  },
  bps: '白皮书',
  yuebuzu: '账户余额不足',
  wlcs: '网络超时',
  tzcspanel: {
    hp1: '投注超时<br>由于你的CPU/NET不足或网络原因导致投注超时，请您放心，您的投注皆在智能合约里执行，因此投注及资金皆不会丢失。<br>请到 <a href="https://bloks.io/" target="_blank">区块链浏览器</a> 中查看结果及详情',
    btn: '确定'
  },
}
